def definition():
    """
    এরে হল এক ধরনের ডাটা স্ট্রাকচার যেখানে এক ধরনের ডাটা একই টাইপের উপাদানগুলি ধারাবাহিকভাবে মেমোরিতে সংরক্ষিত থাকে।

    অপারেশন:

    অ্যাক্সেস: নির্দিষ্ট ইনডেক্স থেকে ডাটা আনা।
    ইনসার্ট: নতুন এলিমেন্ট যোগ করা।
    ডিলিট: একটি এলিমেন্ট মুছে ফেলা।
    আপডেট: একটি নির্দিষ্ট ইনডেক্সে ডাটা পরিবর্তন করা।
    সাইজ: একবার তৈরি হলে এর সাইজ পরিবর্তন করা যায় না। এটি স্ট্যাটিক সাইজিং।

    ডাটা অ্যাক্সেস টাইপ: O(1) — কারণ ইনডেক্সের মাধ্যমে ডাটা সরাসরি অ্যাক্সেস করা যায়।
    """
    
    arr = [1, 2, 3, 4]
    
    # append here
    # arr.append(5)
    # return arr

    # remove here
    arr.remove(4)  # remove item 4
    return arr

# print("add new item in array", definition())
print("remove item in array", definition())
    